export const attackTypeMap = {
  power: {
    name: '力量',
    color: '#b11d1d',
    win: 'speed'
  },
  technical: {
    name: '技巧',
    color: '#1db11d',
    win: 'power'
  },
  speed: {
    name: '速度',
    color: '#1d4db1',
    win: 'technical'
  }
}

export const transformAtkMap = {
  "惨爪龙": ["饥饿", "狂暴化"],
  "苍火龙": ["愤怒","愤怒滞空"],
  "火龙": ["愤怒","愤怒滞空"],
  "毒妖鸟": ["细嚼慢咽","大口咀嚼"],
  "妃蜘蛛": ["无丝","丝缠【茧】"],
  "刚缠兽": ["熔岩","苔藓"],
  "海龙": ["愤怒","蓄电"],
  "海龙（白）": ["愤怒","蓄电"],
  "棘龙": ["愤怒","睡觉"],
  "将军镰蟹": ["无壳","螺壳"],
  "雷狼龙": ["带电","超带电"],
  "泥翁龙": ["愤怒","泥球"],
  "斩龙": ["赤热喉","赤热尾"],
}